app/controllers/friendships_controller.rb

  def index
    # view friends of the current user
  	@user = User.find(current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def create
    # creates friendship between the current user and the user he choose
  	if params[:id] != nil
	  	@friendship = Friendship.new(:user1_id => current_user.id, :user2_id => params[:id])
        @friendship2 = Friendship.new(:user1_id => params[:id], :user2_id => current_user.id)
        # checks if the frienship is saved without errors
	  	if @friendship.save && @friendship2.save
---
INSERT INTO "friendships" ("user1_id", "user2_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user1_id", 2], ["user2_id", 1], ["created_at", "2015-10-28 20:35:04.478497"], ["updated_at", "2015-10-28 20:35:04.478497"]]

  def delete
    friend = User.find(params[:id])
    current_user.friends.delete(friend)
    friendships = Friendship.where("user2_id = ? AND user1_id = ?", current_user.id, friend.id)
    friendships.each do |friendship|
      Friendship.destroy(friendship)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 1]]