app/controllers/group_controller.rb

  def show
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO "groups" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "zamalek"], ["description", "zamalek ya 3omry"], ["created_at", "2015-10-29 15:50:09.182269"], ["updated_at", "2015-10-29 15:50:09.182269"]]

  def edit
      @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @group = Group.find(params[:id])
    if @group.update_attributes(group_params)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", nil]]
UPDATE "groups" SET "image" = $1, "updated_at" = $2 WHERE "groups"."id" = $3  [["image", "attack-on-titan-hd-new-photos-6.jpg"], ["updated_at", "2015-10-29 01:00:40.964434"], ["id", 1]]

  def delete
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]

  def destroy
    group = Group.find(params[:id])
    Group.destroy(group)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]

  def follow
    @group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 1]]

  def unfollow
    group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", 2]]