app/controllers/profile_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def index
    # view the profile of the any user
  	if user_signed_in?
  		if params[:id] == nil
        # intialy views the profile of the current iser
  			@user = User.find(current_user.id)